Revit 2027 API
SpecTypeId.Luminance Property
 Luminance, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Luminance { get; }
Public Shared ReadOnly Property Luminance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Luminance {
	ForgeTypeId^ get ();
}
static member Luminance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace